# Lesson 1

# Easy
#Задача №1
# number_1 = input('Введите 1:')
# number_2 = input('Введите 2:')
# number_3 = input('Введите 3:')
# number_4 = input('Введите 4:')


#Задача №2

# number_2 = 2
# number_1 = int(input('Введите число:'))
# print(number_1 + number_2)


#Задача №3
#
# age = int(input(' Введите возраст:'))
# age_control = 18
#
# if age >= age_control:
#     print('Доступ разрешен')
# else:
#     print('Извините, пользование данным ресурсом только с 18 лет')

# Normal
# Задача №1
# min = 0
# max = 10
#
# number = int(input('Введите число:'))
#
# while min <= number >= max:
#     number = int(input('Диапозон чисел от 0 до 10 :'))
#
# print(number ** 2)

# # Задача №2

# Не знаю как выполнить вторую задачу


# Hard

# Решение последних двух задач оставлю при дополнениии знаниий